Revit 2026 API

# RebarCurvesData Properties

---

The RebarCurvesData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

RebarCurvesData Class

Autodesk.Revit.DB.Structure Namespace